app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]
---
    <div class="col-sm-2">投稿数</div>
    <div class="col-sm-10"><%= @user.posts.count %></div>