app/views/posts/_form.html.erb

SELECT "users".* FROM "users"
---
    ユーザーID
    <%= form.collection_select :user_id, User.all, :id, :id%>