app/views/posts/index.html.erb

SELECT "replies"."id" FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
          <!-- Begin Reply表示 -->
          <% post.replies.each do |reply| %>