app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "こんにちは"], ["body", "修善寺なう！！"], ["created_at", "2017-08-22 08:11:37.918359"], ["updated_at", "2017-08-22 08:11:37.918359"], ["user_id", 3]]