app/controllers/replies_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "replies" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test"], ["post_id", 1], ["created_at", "2017-09-02 03:05:38.905630"], ["updated_at", "2017-09-02 03:05:38.905630"]]
---
  def create
    @post = Post.find(params[:post_id])
    @reply = @post.replies.create(reply_params)